src/app/models/address.rb

SELECT "states".* FROM "states" WHERE "states"."name" = $1 LIMIT $2  [["name", "Western australia"], ["LIMIT", 1]]
---
  def check_if_state_exists
    self.state = State.find_by(name: state.name) if !State.find_by(name: state.name).nil?