src/app/models/user.rb

  def get_simple_location
    "#{self.address.state.name}, #{self.address.state.country.name}"
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]