src/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
SELECT "categories".* FROM "categories"
SELECT "animals".* FROM "animals" WHERE "animals"."category_id" = $1 AND "animals"."sponsored" = $2  [["category_id", 1], ["sponsored", false]]
---
  def index
    #set @animals to all and keep updating based on search queries
    #rails combines all the where queries into 1.
    @animals = Animal.all
    if params[:category]
      if @categories.all.map {|c| c.id}.include? params[:category].to_i
        @animals = @animals.where(category_id: params[:category])
      end
    end
    if params[:sponsored]
      case params[:sponsored]
      when "0"
        @animals = @animals.where(sponsored: false)

INSERT INTO "animals" ("name", "year_born", "weight", "bio", "species", "sponsor_price", "category_id", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    price_dollars = params[:animal][:sponsor_price].to_f
    price_cents = (price_dollars * 100.0).to_i
    @animal = Animal.new(animal_params)
    @animal.sponsor_price = price_cents
    @animal.owner = current_user

    respond_to do |format|
      if @animal.save

UPDATE "animals" SET "updated_at" = $1 WHERE "animals"."id" = $2  [["updated_at", "2021-08-09 10:53:40.913350"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @animal.update(animal_params)

INSERT INTO "messages" ("chat_id", "sender_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chat_id", 1], ["sender_id", 2], ["body", "pls upload more pig pics"], ["created_at", "2021-08-09 10:57:09.540877"], ["updated_at", "2021-08-09 10:57:09.540877"]]
---
  def new_message
    Message.create(body: params[:message], sender_id: current_user.id, chat_id: @animal.sponsorship.chat.id)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1  [["id", 1]]
---
    def set_animal
      @animal = Animal.includes(:owner, :category).find(params[:id])