src/app/controllers/articles_controller.rb

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]
---
  def destroy
    @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_article
      @article = Article.find(params[:id])