src/app/controllers/payments_controller.rb

    def create_payment_intent
        animal = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def webhook
        payment_id = params[:data][:object][:payment_intent]
        payment = Stripe::PaymentIntent.retrieve(payment_id)
        animal_id = payment.metadata.animal_id
        sponsor_id = payment.metadata.user_id
        animal = Animal.find(animal_id)
        animal.update(sponsored: true)
        s = Sponsorship.create(receipt: payment.charges.data[0].receipt_url, animal_id: animal_id, sponsor_id: sponsor_id, owner_id: animal.owner.id)
        Chat.create(sponsorship_id: s.id)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "animals" SET "sponsored" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["sponsored", true], ["updated_at", "2021-08-09 10:54:27.781973"], ["id", 4]]
INSERT INTO "sponsorships" ("receipt", "animal_id", "owner_id", "sponsor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "chats" ("sponsorship_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["sponsorship_id", 1], ["created_at", "2021-08-09 10:54:27.943489"], ["updated_at", "2021-08-09 10:54:27.943489"]]