app/views/animals/show.html.erb

          <strong>Sponsored by: </strong>
          <%= @animal.sponsorship.sponsor.first_name %>
---
SELECT "sponsorships".* FROM "sponsorships" WHERE "sponsorships"."animal_id" = $1 LIMIT $2  [["animal_id", 4], ["LIMIT", 1]]

      <div class="border border-primary p-2 w-50">
        <% @animal.sponsorship.chat.messages.each do |msg| %>
---
SELECT "sponsorships".* FROM "sponsorships" WHERE "sponsorships"."animal_id" = $1 LIMIT $2  [["animal_id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."sponsorship_id" = $1 LIMIT $2  [["sponsorship_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = $1  [["chat_id", 1]]