app/controllers/pages_controller.rb

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def home
    #create random seed using the date to get constant 'daily featured animal' (assuming Animal.count stays constant)
    srand (Date.today.year + Date.today.month + Date.today.day)
    @featured_animal = Animal.find(rand(1..Animal.count))

    #get most recent 5 articles
    @articles = Article.last(5).reverse

SELECT "animals".* FROM "animals" WHERE "animals"."owner_id" = $1  [["owner_id", 4]]
SELECT "sponsorships".* FROM "sponsorships" WHERE "sponsorships"."sponsor_id" = $1  [["sponsor_id", 1]]
---
  def account
    if current_user&.sanctuary?
      @user_animals = Animal.where(owner: current_user)
    else
      @user_animals = Sponsorship.where(sponsor: current_user).map {|s| s.animal}

SELECT "users".* FROM "users" WHERE "users"."approved" = $1  [["approved", false]]
---
  def admin
    @users = User.where(approved: true)

UPDATE "users" SET "updated_at" = $1, "approved" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-08-09 10:52:54.620815"], ["approved", true], ["id", 4]]
---
  def admin_approve_user
    @user.update(approved: true)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def get_user
    @user = User.find(params[:id])