app/models/state.rb

SELECT "countries".* FROM "countries" WHERE "countries"."name" = $1 LIMIT $2  [["name", "Australia"], ["LIMIT", 1]]
---
  def check_if_country_exists
    self.country = Country.find_by(name: country.name) if !Country.find_by(name: country.name).nil?